Revit 2024 API
MEPNetworkSegmentData.SectionNumber Property
 The section this segment belongs to.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public int SectionNumber { get; }
Visual Basic
Public ReadOnly Property SectionNumber As Integer
	Get
Visual C++
public:
property int SectionNumber {
	int get ();
}
See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace